app/Controllers/AdminController.php

SELECT *
FROM `users`
WHERE `role` = 'guest'
SELECT DISTINCT `classification_name`
FROM `classification`
---
public function managedocument()
{
    $userModel = new UserModel();
    $guestUsers = $userModel->where('role', 'guest')->findAll();

    $documentModel = new DocumentModel();
    $documents = $documentModel
        ->select('documents.*, users.first_name, users.last_name, offices.office_name')
        ->join('users', 'users.user_id = documents.sender_id', 'left')
        ->join('offices', 'offices.office_id = documents.recipient_id', 'left')
        ->whereIn('sender_id', array_column($guestUsers, 'user_id'))
        ->findAll();

    $classificationModel = new ClassificationModel();
    $classifications = $classificationModel->distinct()->findColumn('classification_name');
    $classificationsDropdown = array_values($classifications); // Reset array keys to start from 0

    $subClassifications = $classificationModel->findAll();

SELECT *
FROM `classification`
WHERE `classification_name` = 'Letter'
AND `sub_classification` IS NOT NULL
AND `sub_classification` != ''
---
public function getSubClassifications()
{
    $classification = $this->request->getPost('classification');

    $classificationModel = new ClassificationModel();
    $subClassifications = $classificationModel
        ->where('classification_name', $classification)
        ->where('sub_classification !=', null)
        ->where('sub_classification !=', '')
        ->findAll();