app/Controllers/AdminController.php

    public function login()
{
    $userModel = new UserModel();
    $jwtService = new JWTServices(); // Assuming JWTServices is in Controllers or the correct path

    if ($this->request->getMethod() === 'post') {
        $emailOrUsername = $this->request->getPost('emailOrUsername');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $emailOrUsername)
                          ->orWhere('username', $emailOrUsername)
                          ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
OR `username` = 'admin@gmail.com'
 LIMIT 1

    public function manageuser()
    {
        $userModel = new UserModel();
        $users = $userModel->select('users.*, offices.office_name')
            ->join('offices', 'offices.office_id = users.office_id', 'left')
            ->whereIn('users.role', ['admin', 'office user'])
            ->where('users.status', 'activate')
            ->findAll();

        $officeModel = new OfficeModel();
        $data['offices'] = $officeModel->findAll();
---
SELECT *
FROM `offices`



    $officeModel = new OfficeModel();
    $offices = $officeModel->where('status', 'active')->findAll();
---
SELECT *
FROM `offices`
WHERE `status` = 'active'


                if ($sender_office_id === null) {
                    $userModel = new UserModel();
                    $user = $userModel->find($sender_id);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'

                    $sender_office = 'N/A';
                } else {
                    $officeModel = new OfficeModel();
                    $office = $officeModel->find($sender_office_id);
---
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'

        $recipient_office_name = '';
        if ($document['recipient_id'] !== null) {
            $officeModel = new \App\Models\OfficeModel();
            $office = $officeModel->find($document['recipient_id']);
---
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'