app/Controllers/OfficeController.php

    public function history()
    {

        $userId = session('user_id');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'

    public function allDocuments()
    {
        $userId = session('user_id');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        $userName = $user['first_name'] . ' ' . $user['last_name'];

        $officeModel = new OfficeModel();
        $offices = $officeModel->findAll();
---
SELECT *
FROM `offices`

    public function search()
    {
        $userId = session('user_id');
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        $userName = $user['first_name'] . ' ' . $user['last_name'];

        $searchQuery = $this->request->getVar('search');
        $statusFilter = $this->request->getVar('status');
        $sortOption = $this->request->getVar('sort');

        $session = session();
        $officeId = $session->get('office_id');

        $query = $this->db->table('documents')
            ->groupStart()
            ->like('title', $searchQuery)
            ->orLike('tracking_number', $searchQuery)
            ->groupEnd()
            ->where('recipient_id', $officeId);
---
SELECT *
FROM `documents`
WHERE   (
`title` LIKE '%%' ESCAPE '!'
OR  `tracking_number` LIKE '%%' ESCAPE '!'
 )
AND `recipient_id` = '2'
ORDER BY `title` ASC