app/Controllers/OfficeController.php

SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '2'
SELECT *
FROM `documents`
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `recipient_id` = '2'
AND `status` = 'on process'
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `recipient_id` = '2'
SELECT `documents`.*, IFNULL(offices.office_name, CONCAT(users.first_name, " ", users.last_name)) as sender
FROM `documents`
LEFT JOIN `offices` ON `offices`.`office_id` = `documents`.`sender_office_id`
LEFT JOIN `users` ON `users`.`user_id` = `documents`.`sender_id`
WHERE `recipient_id` = '2'
---
    public function index()
    {
        $userId = session('user_id');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        $userName = $user['first_name'] . ' ' . $user['last_name'];


        $officeId = session('office_id');

        $officeModel = new OfficeModel();
        $office = $officeModel->find($officeId);
        // Check if office data is retrieved and office_name exists
        if ($office) {
            $office_name = isset($office['office_name']) ? $office['office_name'] : 'Unknown Office';
        } else {
            $office_name = 'No Office Found';
        }

        $documentModel = new \App\Models\DocumentModel();
        $documents = $documentModel->findAll();

        $db = \Config\Database::connect();

        $pending_documents_count = $db->table('documents')
                                      ->where('recipient_id', $officeId)
                                      ->where('status', 'pending')
                                      ->countAllResults();

        $received_documents_count = $db->table('documents')
                                       ->where('recipient_id', $officeId)
                                       ->where('status', 'on process')
                                       ->countAllResults();

        $total_documents_count = $db->table('documents')
                                     ->where('recipient_id', $officeId)
                                     ->countAllResults();

        $documents = $db->table('documents')
                                     ->select('documents.*, IFNULL(offices.office_name, CONCAT(users.first_name, " ", users.last_name)) as sender')
                                     ->join('offices', 'offices.office_id = documents.sender_office_id', 'left')
                                     ->join('users', 'users.user_id = documents.sender_id', 'left')
                                     ->where('recipient_id', $officeId)
                                     ->get()
                                     ->getResult();

SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '2'
---
    public function pending()
    {
        $userId = session('user_id');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        $userName = $user['first_name'] . ' ' . $user['last_name'];

        $session = session();
        $office_id = $session->get('office_id');

        $officeModel = new OfficeModel();
        $office = $officeModel->find($office_id);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'
---

            if ($sender_office_id === null) {
                $userModel = new UserModel();
                $user = $userModel->find($sender_id);

SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'
---
                $sender_office = 'N/A';
            } else {
                $officeModel = new OfficeModel();
                $office = $officeModel->find($sender_office_id);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '2'
---
public function ongoing()
{

    $userId = session('user_id');

    $userModel = new \App\Models\UserModel();
    $user = $userModel->find($userId);
    $userName = $user['first_name'] . ' ' . $user['last_name'];

    $session = session();
    $office_id = $session->get('office_id');

    $officeModel = new OfficeModel();
    $office = $officeModel->find($office_id);

SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'
---
            $sender_office = 'N/A';
        } else {
            $officeModel = new OfficeModel();
            $office = $officeModel->find($sender_office_id);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '2'
---
public function received()
{

    $userId = session('user_id');

    $userModel = new \App\Models\UserModel();
    $user = $userModel->find($userId);
    $userName = $user['first_name'] . ' ' . $user['last_name'];

    $session = session();
    $office_id = $session->get('office_id');

    $officeModel = new OfficeModel();
    $office = $officeModel->find($office_id);

SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'
---
        } else {
            $sender_user_id = null;
            $senderOfficeModel = new OfficeModel();
            $senderOffice = $senderOfficeModel->find($document->sender_office_id);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'
---

        if ($sender_user_id !== null) {
            $senderUserModel = new UserModel();
            $senderUser = $senderUserModel->find($sender_user_id);

SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'
---
    private function getCurrentOfficeId($documentId)
    {
        $db = \Config\Database::connect();
        $query = $db->table('offices_documents')
                    ->select('office_id')
                    ->where('document_id', $documentId)
                    ->get();

        if ($query->getNumRows() > 0) {
            return $query->getRow()->office_id;

SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '2'
---
    public function history()
    {

        $userId = session('user_id');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        $userName = $user['first_name'] . ' ' . $user['last_name'];

        $session = session();
        $office_id = $session->get('office_id');

        $officeModel = new OfficeModel();
        $office = $officeModel->find($office_id);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'
---

            if ($sender_office_id === null) {
                $userModel = new UserModel();
                $user = $userModel->find($sender_user_id);

SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'
---
                $sender_office = '';
            } else {
                $officeModel = new OfficeModel();
                $office = $officeModel->find($sender_office_id);

SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '2'
SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
---
    public function manageprofile()
    {
        $userId = session('user_id');

        $session = session();
        $office_id = $session->get('office_id');

        $officeModel = new OfficeModel();
        $office = $officeModel->find($office_id);
        $office_name = $office['office_name'];

        if (!$userId) {
            return 'Error: User ID not set';
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
---
    public function trash()
    {

        $userId = session('user_id');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);