app/Controllers/UserController.php

SELECT *
FROM `documents`
WHERE `tracking_number` = 'TR-661550bc1443a'
 LIMIT 1
SELECT *
FROM `offices`
WHERE `office_id` = '1'
 LIMIT 1
---
    public function guestsearchResults()
    {
        $request = \Config\Services::request();
        $trackingNumber = $request->getPost('tracking_number');

        $documentModel = new DocumentModel();
        $document = $documentModel->where('tracking_number', $trackingNumber)->first();

        $officeModel = new OfficeModel();
        $office = null;
        if ($document && isset($document['recipient_id'])) {
            $office = $officeModel->where('office_id', $document['recipient_id'])->first();

SELECT *
FROM `documents`
WHERE `tracking_number` = 'TR-6627299392b66'
 LIMIT 1
SELECT *
FROM `offices`
WHERE `offices`.`office_id` = '1'
---
    public function track()
    {
        $request = \Config\Services::request();
        $trackingNumber = $request->getGet('number');  // Get 'number' from query string

        if (!$trackingNumber) {
            return redirect()->to('/errorPage'); // Redirect to an error page if no tracking number is provided
        }

        $documentModel = new DocumentModel();
        $document = $documentModel->where('tracking_number', $trackingNumber)->first();

        if (!$document) {
            return view('Errors/NoDocument');  // Show an error view if no document is found
        }

        // Assume additional data is fetched like office details, progress percentage etc.
        $officeModel = new OfficeModel();
        $office = $officeModel->find($document['recipient_id']);